7767517
151 173
Input            src                      0 1 src
Split            splitncnn_input0         1 3 src src_splitncnn_0 src_splitncnn_1 src_splitncnn_2
Convolution      Conv_0                   1 1 src_splitncnn_2 363 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864
Clip             Clip_4                   1 1 363 367 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_5                   1 1 367 368 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
Clip             Clip_9                   1 1 368 372 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_10                  1 1 372 373 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Split            splitncnn_0              1 2 373 373_splitncnn_0 373_splitncnn_1
Convolution      Conv_12                  1 1 373_splitncnn_1 375 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1536
Clip             Clip_16                  1 1 375 379 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_17                  1 1 379 380 0=96 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864 7=96
Clip             Clip_21                  1 1 380 384 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_22                  1 1 384 385 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2304
Split            splitncnn_1              1 2 385 385_splitncnn_0 385_splitncnn_1
Convolution      Conv_24                  1 1 385_splitncnn_1 387 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
Clip             Clip_28                  1 1 387 391 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_29                  1 1 391 392 0=144 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
Clip             Clip_33                  1 1 392 396 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_34                  1 1 396 397 0=24 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
BinaryOp         Add_36                   2 1 385_splitncnn_0 397 399 0=0
Split            splitncnn_2              1 2 399 399_splitncnn_0 399_splitncnn_1
Convolution      Conv_37                  1 1 399_splitncnn_1 400 0=144 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3456
Clip             Clip_41                  1 1 400 404 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_42                  1 1 404 405 0=144 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1296 7=144
Clip             Clip_46                  1 1 405 409 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_47                  1 1 409 410 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4608
Split            splitncnn_3              1 2 410 410_splitncnn_0 410_splitncnn_1
Convolution      Conv_49                  1 1 410_splitncnn_1 412 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_53                  1 1 412 416 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_54                  1 1 416 417 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_58                  1 1 417 421 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_59                  1 1 421 422 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_61                   2 1 410_splitncnn_0 422 424 0=0
Split            splitncnn_4              1 2 424 424_splitncnn_0 424_splitncnn_1
Convolution      Conv_62                  1 1 424_splitncnn_1 425 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_66                  1 1 425 429 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_67                  1 1 429 430 0=192 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_71                  1 1 430 434 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_72                  1 1 434 435 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
BinaryOp         Add_74                   2 1 424_splitncnn_0 435 437 0=0
Split            splitncnn_5              1 2 437 437_splitncnn_0 437_splitncnn_1
Convolution      Conv_75                  1 1 437_splitncnn_1 438 0=192 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6144
Clip             Clip_79                  1 1 438 442 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_80                  1 1 442 443 0=192 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1728 7=192
Clip             Clip_84                  1 1 443 447 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_85                  1 1 447 448 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12288
Split            splitncnn_6              1 2 448 448_splitncnn_0 448_splitncnn_1
Convolution      Conv_87                  1 1 448_splitncnn_1 450 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_91                  1 1 450 454 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_92                  1 1 454 455 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_96                  1 1 455 459 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_97                  1 1 459 460 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_99                   2 1 448_splitncnn_0 460 462 0=0
Split            splitncnn_7              1 2 462 462_splitncnn_0 462_splitncnn_1
Convolution      Conv_100                 1 1 462_splitncnn_1 463 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_104                 1 1 463 467 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_105                 1 1 467 468 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_109                 1 1 468 472 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_110                 1 1 472 473 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_112                  2 1 462_splitncnn_0 473 475 0=0
Split            splitncnn_8              1 2 475 475_splitncnn_0 475_splitncnn_1
Convolution      Conv_113                 1 1 475_splitncnn_1 476 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_117                 1 1 476 480 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_118                 1 1 480 481 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_122                 1 1 481 485 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_123                 1 1 485 486 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
BinaryOp         Add_125                  2 1 475_splitncnn_0 486 488 0=0
Convolution      Conv_126                 1 1 488 489 0=384 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=24576
Clip             Clip_130                 1 1 489 493 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_131                 1 1 493 494 0=384 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456 7=384
Clip             Clip_135                 1 1 494 498 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_136                 1 1 498 499 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=36864
Split            splitncnn_9              1 2 499 499_splitncnn_0 499_splitncnn_1
Convolution      Conv_138                 1 1 499_splitncnn_1 501 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             Clip_142                 1 1 501 505 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_143                 1 1 505 506 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
Clip             Clip_147                 1 1 506 510 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_148                 1 1 510 511 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         Add_150                  2 1 499_splitncnn_0 511 513 0=0
Split            splitncnn_10             1 2 513 513_splitncnn_0 513_splitncnn_1
Convolution      Conv_151                 1 1 513_splitncnn_1 514 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             Clip_155                 1 1 514 518 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_156                 1 1 518 519 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
Clip             Clip_160                 1 1 519 523 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_161                 1 1 523 524 0=96 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
BinaryOp         Add_163                  2 1 513_splitncnn_0 524 526 0=0
Convolution      Conv_164                 1 1 526 527 0=576 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=55296
Clip             Clip_168                 1 1 527 531 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_169                 1 1 531 532 0=576 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=5184 7=576
Clip             Clip_173                 1 1 532 536 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_174                 1 1 536 537 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=92160
Split            splitncnn_11             1 2 537 537_splitncnn_0 537_splitncnn_1
Convolution      Conv_176                 1 1 537_splitncnn_1 539 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
Clip             Clip_180                 1 1 539 543 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_181                 1 1 543 544 0=960 1=3 11=3 2=2 12=2 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=8640 7=960
Clip             Clip_185                 1 1 544 548 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_186                 1 1 548 549 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_188                  2 1 537_splitncnn_0 549 551 0=0
Split            splitncnn_12             1 2 551 551_splitncnn_0 551_splitncnn_1
Convolution      Conv_189                 1 1 551_splitncnn_1 552 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
Clip             Clip_193                 1 1 552 556 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_194                 1 1 556 557 0=960 1=3 11=3 2=2 12=2 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=8640 7=960
Clip             Clip_198                 1 1 557 561 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_199                 1 1 561 562 0=160 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
BinaryOp         Add_201                  2 1 551_splitncnn_0 562 564 0=0
Convolution      Conv_202                 1 1 564 565 0=960 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=153600
Clip             Clip_206                 1 1 565 569 0=0.000000e+00 1=6.000000e+00
ConvolutionDepthWise Conv_207                 1 1 569 570 0=960 1=3 11=3 2=2 12=2 3=1 13=1 4=2 14=2 15=2 16=2 5=1 6=8640 7=960
Clip             Clip_211                 1 1 570 574 0=0.000000e+00 1=6.000000e+00
Convolution      Conv_212                 1 1 574 575 0=320 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=307200
Split            splitncnn_13             1 5 575 575_splitncnn_0 575_splitncnn_1 575_splitncnn_2 575_splitncnn_3 575_splitncnn_4
Convolution      Conv_214                 1 1 575_splitncnn_4 577 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=81920
ReLU             Relu_216                 1 1 577 579
Convolution      Conv_217                 1 1 575_splitncnn_3 580 0=256 1=3 11=3 2=3 12=3 3=1 13=1 4=3 14=3 15=3 16=3 5=1 6=737280
ReLU             Relu_219                 1 1 580 582
Convolution      Conv_220                 1 1 575_splitncnn_2 583 0=256 1=3 11=3 2=6 12=6 3=1 13=1 4=6 14=6 15=6 16=6 5=1 6=737280
ReLU             Relu_222                 1 1 583 585
Convolution      Conv_223                 1 1 575_splitncnn_1 586 0=256 1=3 11=3 2=9 12=9 3=1 13=1 4=9 14=9 15=9 16=9 5=1 6=737280
ReLU             Relu_225                 1 1 586 588
Pooling          GlobalAveragePool_232    1 1 575_splitncnn_0 595 0=1 4=1
Convolution      Conv_233                 1 1 595 596 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=81920
ReLU             Relu_235                 1 1 596 598
Interp           Resize_248               1 1 598 611 0=2 1=1.000000e+00 2=1.000000e+00 3=32 4=32 6=0
Concat           Concat_249               5 1 579 582 585 588 611 612 0=0
Convolution      Conv_250                 1 1 612 613 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=327680
ReLU             Relu_252                 1 1 613 615
Interp           Resize_271               1 1 615 634 0=2 1=1.000000e+00 2=1.000000e+00 3=64 4=64 6=0
Concat           Concat_272               2 1 634 437_splitncnn_0 635 0=0
Convolution      Conv_273                 1 1 635 636 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=331776
ReLU             Relu_275                 1 1 636 638
Interp           Resize_294               1 1 638 657 0=2 1=1.000000e+00 2=1.000000e+00 3=128 4=128 6=0
Concat           Concat_295               2 1 657 399_splitncnn_0 658 0=0
Convolution      Conv_296                 1 1 658 659 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=87552
ReLU             Relu_298                 1 1 659 661
Interp           Resize_317               1 1 661 680 0=2 1=1.000000e+00 2=1.000000e+00 3=256 4=256 6=0
Concat           Concat_318               2 1 680 373_splitncnn_0 681 0=0
Convolution      Conv_319                 1 1 681 682 0=48 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=34560
ReLU             Relu_321                 1 1 682 684
Interp           Resize_340               1 1 684 703 0=2 1=1.000000e+00 2=1.000000e+00 3=512 4=512 6=0
Concat           Concat_341               2 1 703 src_splitncnn_1 704 0=0
Convolution      Conv_342                 1 1 704 705 0=37 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=16983
Split            splitncnn_14             1 4 705 705_splitncnn_0 705_splitncnn_1 705_splitncnn_2 705_splitncnn_3
Crop             Slice_347                1 1 705_splitncnn_3 710 -23309=1,0 -23310=1,1 -23311=1,0
Clip             Clip_348                 1 1 710 pha 0=0.000000e+00 1=1.000000e+00
Crop             Slice_353                1 1 705_splitncnn_2 720 -23309=1,1 -23310=1,4 -23311=1,0
BinaryOp         Add_354                  2 1 720 src_splitncnn_0 721 0=0
Clip             Clip_355                 1 1 721 fgr 0=0.000000e+00 1=1.000000e+00
Crop             Slice_360                1 1 705_splitncnn_1 731 -23309=1,4 -23310=1,5 -23311=1,0
Clip             Clip_361                 1 1 731 err_sm 0=0.000000e+00 1=1.000000e+00
Crop             Slice_366                1 1 705_splitncnn_0 741 -23309=1,5 -23310=1,2147483647 -23311=1,0
ReLU             Relu_367                 1 1 741 ref_sm
